cuu/YAHAL/include/MCU/rp2040/RP2040_regs.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PADS_BANK0</name>
      <version>1</version>
      <baseAddress>0x4001c000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>VOLTAGE_SELECT</name>
          <description>Voltage select. Per bank control</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VOLTAGE_SELECT</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3v3</name>
                  <description>Set voltage to 3.3V (DVDD &gt;= 2V5)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1v8</name>
                  <description>Set voltage to 1.8V (DVDD &lt;= 1V8)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>30</dim>
          <dimIncrement>4</dimIncrement>
          <name>GPIO%s</name>
          <description>Pad control register</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00000056</resetValue>
          <fields>
            <field>
              <name>OD</name>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Input enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive strength.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull up enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE</name>
              <description>Pull down enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Enable schmitt trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWFAST</name>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCLK</name>
          <description>Pad control register</description>
          <addressOffset>0x007c</addressOffset>
          <resetValue>0x000000da</resetValue>
          <fields>
            <field>
              <name>OD</name>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Input enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive strength.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull up enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE</name>
              <description>Pull down enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Enable schmitt trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWFAST</name>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD</name>
          <description>Pad control register</description>
          <addressOffset>0x0080</addressOffset>
          <resetValue>0x0000005a</resetValue>
          <fields>
            <field>
              <name>OD</name>
              <description>Output disable. Has priority over output enable from peripherals</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Input enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DRIVE</name>
              <description>Drive strength.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2mA</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8mA</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12mA</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull up enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDE</name>
              <description>Pull down enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SCHMITT</name>
              <description>Enable schmitt trigger</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEWFAST</name>
              <description>Slew rate control. 1 = Fast, 0 = Slow</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
