cuu/YAHAL/include/MCU/rp2040/RP2040_regs.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <baseAddress>0x40048000</baseAddress>
      <interrupt>
        <name>I2C1_IRQ</name>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <version>2</version>
      <description>Control and data interface to SAR ADC</description>
      <baseAddress>0x4004c000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_IRQ_FIFO</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>CS</name>
          <description>ADC Control and Status</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RROBIN</name>
              <description>Round-robin sampling. 1 bit per channel. Set all bits to 0 to disable.\n
                Otherwise, the ADC will cycle through each enabled channel in a round-robin fashion.\n
                The first channel to be sampled will be the one currently indicated by AINSEL.\n
                AINSEL will be updated after each conversion with the newly-selected channel.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AINSEL</name>
              <description>Select analog mux input. Updated automatically in round-robin mode.</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_STICKY</name>
              <description>Some past ADC conversion encountered an error. Write 1 to clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ERR</name>
              <description>The most recent ADC conversion encountered an error; result is undefined or noisy.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>READY</name>
              <description>1 if the ADC is ready to start a new conversion. Implies any previous conversion has completed.\n
                0 whilst conversion in progress.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>START_MANY</name>
              <description>Continuously perform conversions whilst this bit is 1. A new conversion will start immediately after the previous finishes.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START_ONCE</name>
              <description>Start a single conversion. Self-clearing. Ignored if start_many is asserted.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>TS_EN</name>
              <description>Power on temperature sensor. 1 - enabled. 0 - disabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Power on ADC and enable its clock.\n
                1 - enabled. 0 - disabled.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result of most recent ADC conversion</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESULT</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCS</name>
          <description>FIFO control and status</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THRESH</name>
              <description>DREQ/IRQ asserted when level &gt;= threshold</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL</name>
              <description>The number of conversion results currently waiting in the FIFO</description>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVER</name>
              <description>1 if the FIFO has been overflowed. Write 1 to clear.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>UNDER</name>
              <description>1 if the FIFO has been underflowed. Write 1 to clear.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FULL</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EMPTY</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DREQ_EN</name>
              <description>If 1: assert DMA requests when FIFO contains data</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR</name>
              <description>If 1: conversion error bit appears in the FIFO alongside the result</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SHIFT</name>
              <description>If 1: FIFO results are right-shifted to be one byte in size. Enables DMA to byte buffers.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>If 1: write result to the FIFO after each conversion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO</name>
          <description>Conversion result FIFO</description>
          <addressOffset>0x000c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ERR</name>
              <description>1 if this particular sample experienced a conversion error. Remains in the same location if the sample is shifted.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VAL</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV</name>
          <description>Clock divider. If non-zero, CS_START_MANY will start conversions\n
            at regular intervals rather than back-to-back.\n
            The divider is reset when either of these fields are written.\n
            Total period is 1 + INT + FRAC / 256</description>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>Integer part of clock divisor.</description>
              <bitRange>[23:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <description>Fractional part of clock divisor. First-order delta-sigma.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0x0014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level.\n
                This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x0018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level.\n
                This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <description>Interrupt Force</description>
          <addressOffset>0x001c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level.\n
                This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS</name>
          <description>Interrupt status after masking &amp; forcing</description>
          <addressOffset>0x0020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIFO</name>
              <description>Triggered when the sample FIFO reaches a certain level.\n
                This level can be programmed via the FCS_THRESH field.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
