cuu/YAHAL/include/MCU/rp2040/RP2040_regs.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG</name>
      <version>1</version>
      <baseAddress>0x40058000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Watchdog control\n
            The rst_wdsel register determines which subsystems are reset when the watchdog is triggered.\n
            The watchdog can be triggered in software.</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x07000000</resetValue>
          <fields>
            <field>
              <name>TRIGGER</name>
              <description>Trigger a watchdog reset</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>When not enabled the watchdog timer is paused</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE_DBG1</name>
              <description>Pause the watchdog timer when processor 1 is in debug mode</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE_DBG0</name>
              <description>Pause the watchdog timer when processor 0 is in debug mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE_JTAG</name>
              <description>Pause the watchdog timer when JTAG is accessing the bus fabric</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TIME</name>
              <description>Indicates the number of ticks / 2 (see errata RP2040-E1) before a watchdog reset will be triggered</description>
              <bitRange>[23:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOAD</name>
          <description>Load the watchdog timer. The maximum setting is 0xffffff which corresponds to 0xffffff / 2 ticks before triggering a watchdog reset (see errata RP2040-E1).</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOAD</name>
              <bitRange>[23:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REASON</name>
          <description>Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORCE</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMER</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <name>SCRATCH%s</name>
          <description>Scratch register. Information persists through soft reset of the chip.</description>
          <addressOffset>0x000c</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>TICK</name>
          <description>Controls the tick generator</description>
          <addressOffset>0x002c</addressOffset>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
              <bitRange>[19:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING</name>
              <description>Is the tick generator running?</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>start / stop tick generation</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CYCLES</name>
              <description>Total number of clk_tick cycles before the next tick.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <version>1</version>
      <description>Register block to control RTC</description>
      <baseAddress>0x4005c000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC_IRQ</name>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CLKDIV_M1</name>
          <description>Divider minus 1 for the 1 second counter. Safe to change the value when RTC is not enabled.</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV_M1</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP_0</name>
          <description>RTC setup register 0</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YEAR</name>
              <description>Year</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month (1..12)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY</name>
              <description>Day of the month (1..31)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SETUP_1</name>
          <description>RTC setup register 1</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOTW</name>
              <description>Day of the week: 1-Monday...0-Sunday ISO 8601 mod 7</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hours</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN</name>
              <description>Minutes</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Seconds</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>RTC Control and status</description>
          <addressOffset>0x000c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORCE_NOTLEAPYEAR</name>
              <description>If set, leapyear is forced off.\n
                Useful for years divisible by 100 but not by 400</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>Load RTC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>RTC_ACTIVE</name>
              <description>RTC enabled (running)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RTC_ENABLE</name>
              <description>Enable RTC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_SETUP_0</name>
          <description>Interrupt setup register 0</description>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCH_ACTIVE</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCH_ENA</name>
              <description>Global match enable. Don't change any other value while this one is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YEAR_ENA</name>
              <description>Enable year matching</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MONTH_ENA</name>
              <description>Enable month matching</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY_ENA</name>
              <description>Enable day matching</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>Year</description>
              <bitRange>[23:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month (1..12)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY</name>
              <description>Day of the month (1..31)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_SETUP_1</name>
          <description>Interrupt setup register 1</description>
          <addressOffset>0x0014</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOTW_ENA</name>
              <description>Enable day of the week matching</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR_ENA</name>
              <description>Enable hour matching</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN_ENA</name>
              <description>Enable minute matching</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_ENA</name>
              <description>Enable second matching</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DOTW</name>
              <description>Day of the week</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hours</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN</name>
              <description>Minutes</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Seconds</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_1</name>
          <description>RTC register 1.</description>
          <addressOffset>0x0018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>YEAR</name>
              <description>Year</description>
              <bitRange>[23:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>Month (1..12)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DAY</name>
              <description>Day of the month (1..31)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_0</name>
          <description>RTC register 0\n
            Read this before RTC 1!</description>
          <addressOffset>0x001c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DOTW</name>
              <description>Day of the week</description>
              <bitRange>[26:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hours</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN</name>
              <description>Minutes</description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC</name>
              <description>Seconds</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Raw Interrupts</description>
          <addressOffset>0x0020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x0024</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <description>Interrupt Force</description>
          <addressOffset>0x0028</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTS</name>
          <description>Interrupt status after masking &amp; forcing</description>
          <addressOffset>0x002c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
