cuu/YAHAL/include/MCU/rp2040/RP2040_regs.svd
        <register>
          <name>SNIFF_CTRL</name>
          <description>Sniffer Control</description>
          <addressOffset>0x0434</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT_INV</name>
              <description>If set, the result appears inverted (bitwise complement) when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_REV</name>
              <description>If set, the result appears bit-reversed when read. This does not affect the way the checksum is calculated; the result is transformed on-the-fly between the result register and the bus.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BSWAP</name>
              <description>Locally perform a byte reverse on the sniffed data, before feeding into checksum.\n\n
                Note that the sniff hardware is downstream of the DMA channel byteswap performed in the read master: if channel CTRL_BSWAP and SNIFF_CTRL_BSWAP are both enabled, their effects cancel from the sniffer's point of view.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CALC</name>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC32</name>
                  <description>Calculate a CRC-32 (IEEE802.3 polynomial)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC32R</name>
                  <description>Calculate a CRC-32 (IEEE802.3 polynomial) with bit reversed data</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC16</name>
                  <description>Calculate a CRC-16-CCITT</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC16R</name>
                  <description>Calculate a CRC-16-CCITT with bit reversed data</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVEN</name>
                  <description>XOR reduction over all data. == 1 if the total 1 population count is odd.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUM</name>
                  <description>Calculate a simple 32-bit checksum (addition with a 32 bit accumulator)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMACH</name>
              <description>DMA channel for Sniffer to observe</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable sniffer</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SNIFF_DATA</name>
          <description>Data accumulator for sniff hardware\n
            Write an initial seed value here before starting a DMA transfer on the channel indicated by SNIFF_CTRL_DMACH. The hardware will update this register each time it observes a read from the indicated channel. Once the channel completes, the final result can be read from this register.</description>
          <addressOffset>0x0438</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>FIFO_LEVELS</name>
          <description>Debug RAF, WAF, TDF levels</description>
          <addressOffset>0x0440</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAF_LVL</name>
              <description>Current Read-Address-FIFO fill level</description>
              <bitRange>[23:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WAF_LVL</name>
              <description>Current Write-Address-FIFO fill level</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TDF_LVL</name>
              <description>Current Transfer-Data-FIFO fill level</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHAN_ABORT</name>
          <description>Abort an in-progress transfer sequence on one or more channels</description>
          <addressOffset>0x0444</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHAN_ABORT</name>
              <description>Each bit corresponds to a channel. Writing a 1 aborts whatever transfer sequence is in progress on that channel. The bit will remain high until any in-flight transfers have been flushed through the address and data FIFOs.\n\n
                After writing, this register must be polled until it returns all-zero. Until this point, it is unsafe to restart the channel.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>N_CHANNELS</name>
          <description>The number of channels this DMA instance is equipped with. This DMA supports up to 16 hardware channels, but can be configured with as few as one, to minimise silicon area.</description>
          <addressOffset>0x0448</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>N_CHANNELS</name>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>64</dimIncrement>
          <name>CH%s_DBG_CTDREQ</name>
          <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
          <addressOffset>0x0800</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_CTDREQ</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>64</dimIncrement>
          <name>CH%s_DBG_TCR</name>
          <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
          <addressOffset>0x0804</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
